app/controllers/build_schedules_controller.rb

  def index
    @build_schedules = BuildSchedule.all
---
SELECT "build_schedules".* FROM "build_schedules"