app/controllers/course_schedules_controller.rb

  def index
    @course_schedules = CourseSchedule.all
---
SELECT "course_schedules".* FROM "course_schedules"

  def create
    @course_schedule = CourseSchedule.new(course_schedule_params)

    respond_to do |format|
      if @course_schedule.save
---
INSERT INTO "course_schedules" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-06-25 03:45:23.168243"], ["updated_at", "2017-06-25 03:45:23.168243"]]

    def set_course_schedule
      @course_schedule = CourseSchedule.find(params[:id])
---
SELECT  "course_schedules".* FROM "course_schedules" WHERE "course_schedules"."id" = ? LIMIT 1  [["id", 1]]