app/controllers/courses_controller.rb

  def index
    @courses = Courses.all
---
SELECT "courses".* FROM "courses"

  def create
    # render plain: params[:courses].inspect
    @courses = Courses.new(courses_params)

    respond_to do |format|
      if @courses.save
---
INSERT INTO "courses" ("name", "times", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "'CMPT 120' "], ["times", "[ ['M', '830', '1020'], ['F', '830', '920'] ]"], ["created_at", "2017-06-23 03:05:45.659713"], ["updated_at", "2017-06-23 03:05:45.659713"]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]

    def set_course
      @course = Courses.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]