app/controllers/schedules_builders_controller.rb

  def index
    @schedules_builders = SchedulesBuilder.all
---
SELECT "schedules_builders".* FROM "schedules_builders"

  def create
    @schedules_builder = SchedulesBuilder.new(params[:classes])

    respond_to do |format|
      if @schedules_builder.save
---
INSERT INTO "schedules_builders" ("classes", "created_at", "updated_at") VALUES (?, ?, ?)  [["classes", "asfasfasf"], ["created_at", "2017-06-23 05:27:18.376146"], ["updated_at", "2017-06-23 05:27:18.376146"]]

    def set_schedules_builder
      @schedules_builder = SchedulesBuilder.find(params[:id])
---
SELECT  "schedules_builders".* FROM "schedules_builders" WHERE "schedules_builders"."id" = ? LIMIT 1  [["id", 2]]