app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
    @schedules = Schedule.all

INSERT INTO "schedules" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-06-22 21:58:04.575030"], ["updated_at", "2017-06-22 21:58:04.575030"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])